import React, { useState } from 'react';
import {
  Box,
  Container,
  Grid,
  Typography,
  IconButton,
  Divider,
  Card,
  CardMedia,
  Button,
  TextField,
} from '@mui/material';
import { Facebook, Twitter, Instagram, LinkedIn } from '@mui/icons-material';
import KeyboardArrowUpIcon from '@mui/icons-material/KeyboardArrowUp';
import KeyboardArrowLeftIcon from '@mui/icons-material/KeyboardArrowLeft';
const abouts = [
  'تلفن پشتیبانی ۶۱۹۳۰۰۰۰ - ۰۲۱',
  ' ',
  '|',
  ' ',
  '۰۲۱-۹۱۰۰۰۱۰۰',
  ' ',
  '|',
  ' ',
  '۷ روز هفته، ۲۴ ساعته پاسخگوی شما هستیم',
];
const baDigiKala = [
  'اتاق خبر دیجی‌کالا',
  'فروش در دیجی‌کالا',
  ' فرصت‌های شغلی',
  ' گزارش تخلف در دیجی‌کالا',
  ' تماس با دیجی‌کالا',
  ' درباره دیجی‌کالا',
];
const customerServices = [
  'پاسخ به پرسش‌های متداول',
  ' رویه‌های بازگرداندن کالا',
  ' شرایط استفاده',
  ' حریم خصوصی',
  ' گزارش باگ',
];
const BuyingGuideFromDigikala = [
  'نحوه ثبت سفارش',
  'رویه ارسال سفارش',
  'شیوه‌های پرداخت',
];

const text = `یک خرید اینترنتی مطمئن، نیازمند فروشگاهی است که بتواند کالاهایی متنوع، باکیفیت و دارای قیمت مناسب را در مدت زمان ی کوتاه به دست مشتریان خود برساند و ضمانت بازگشت کالا هم داشته باشد؛ ویژگی‌هایی که فروشگاه اینترنتی دیجی‌کالا سال‌هاست بر روی آن‌ها کار کرده و توانسته از این طریق مشتریان ثابت خود را داشته باشد.
    یکی از مهم‌ترین دغدغه‌های کاربران دیجی‌کالا یا هر فروشگاه‌ اینترنتی دیگری، این است که کالای خریداری شده چه زمانی به دستشان می‌رسد. دیجی‌کالا شیوه‌های مختلفی از ارسال را متناسب با فروشنده کالا،‌ مقصد کالا و همچنین نوع کالا در اختیار کاربران خود قرار می‌دهد. هر یک از روش های ارسال دیجی کالا شرایط و ویژگی‌های خاص خود را دارند که ممکن است گاهی برای کاربران جدید، مبهم و پیچیده به نظر برسند. برای آگاهی بیشتر مشتریان از خدمات دیجی‌کالا، این فروشگاه اینترنتی در بخشی از وب‌سایت خود راهنمای کاملی از شیوه‌‌های ارسال را به صورت ساده و به دور از پیچیدگی، قرار داده است که شامل 8 نوع ارسال کالا به روش‌های زیر است: ارسال امروز، دریافت حضوری، دریافت از گنجه، ارسال توسط فروشنده، ارسال عادی، ارسال کالاهای بزرگ، سنگین و فوق سنگین، ارسال سریع سوپرمارکتی، ارسال با پست

    کدام محصولات در دیجی‌کالا قابل سفارش هستند؟

    تقریبا می‌توان گفت محصولی وجود ندارد که دیجی‌کالا برای مشتریان خود در سراسر کشور فراهم نکرده باشد. شما می‌توانید در تمامی روزهای هفته و تمامی شبانه روز دیجی‌کالا که محصولات دارای تخفیف عالی می‌شوند، سفارش خود را به سادگی ثبت کرده و در روز و محدوده زمانی مناسب خود، درب منزل تحویل بگیرید. بعضی از گروه‌های اصلی و زیر مجموعه‌های پرطرفدار محصولات دیجی‌کالا شامل مواردی می‌شود که در ادامه به معرفی آن‌ها می‌پردازیم که امکان ارسال امروز برای آن ها وجود دارد.

    کالای دیجیتال

    انواع گوشی موبایل از برندهای مختلفی مثل آیفون،  گوشی سامسونگ، گوشی نوکیا، گوشی شیائومی، گوشی هواوی، و...، انواع کنسول بازی ps4 و ps5، انواع تبلت‌های پرطرفدار مثل تبلت سامسونگ نوت 10، انواع هندزفری مثل هندزفری بی سیم، تلوزیون از برندهای مختلف مثل تلویزیون سامسونگ، سونی و...، انواع مانیتور، کیس، کیبورد، مودم از برندهای مختلف مثل مودم ایرانسل، آنتن و ... تنها بخشی از محصولاتی هستند که زیر مجموعه کالای دیجیتال در دیجی‌کالا قرار دارند.

    خودرو، ابزار و تجهیزات صنعتی

    انواع خودروهای ایرانی و خارجی از برندهای مطرحی مثل هوندا، کیا و...، موتور سیکلت از برندهایی مثل کویر موتور و...، لوازم جانبی خودرو مثل سیستم صوتی تصویر، ضبط و...، لوازم یدکی مثل دیسک و صفحه کلاج و... و لوازم مصرفی خودرو مثل کفپوش سانا در این گروه قرار می‌گیرند.

    مد و پوشاک

    محصولاتی مثل انواع لباس مثل لباس مجلسی زنانه و مردانه، لباس راحتی، لباس ورزشی، اکسسوری، کیف، کفش، عینک آفتابی، لباس زیر، شال و روسری و... جزو مواردی هستند که می‌توانید آن‌ها را از برندهای مطرح ایرانی و خارجی موجود در دیجی کالا مثل آدیداس، نایکی، دبنهامز، آلدو، درسا و... خریداری کنید.

    اسباب بازی کودک و نوزاد

    در این دسته از کالاهای دیجی‌کالا، انواع لوازم بهداشتی و حمام کودک و نوزاد، انواع پوشاک و کفش، تبلت، اسباب‌بازی، لوازم اتاق خواب کودک، لوازم ایمنی، لوازم شخصی و غذا خوری و ... قرار می‌گیرد تا خرید را برای پدر و مادرها به کاری سریع و آسان تبدیل کند.

    کالاهای سوپر مارکتی

    هر چیزی از مواد خوراکی که به آن نیاز دارید، در سوپرمارکت دیجی‌کالا پیدا می‌شود، محصولات پرطرفداری مثل کره بادام‌زمینی، عسل، سس، قهوه، زعفران، شکلات، انواع نان و ... از برندهای معتبر و معروفی مثل نستله، نوتلا، استارباکس، مزمز، چی توز و ... همگی در اختیار شما هستند و تا رسیدن به آشپزخانه شما تنها چند کلیک فاصله دارند.

    زیبایی و سلامت

    انواع لوازم آرایش مثل لاک، رنگ مو، لوازم آرایش لب، چشم، صورت و... همگی در دیجی‌کالا موجود هستند. همچنین محصولات بهداشتی مثل انواع شامپو، کرم، ماسک صورت، ضد تعریق، ماسک مو  و...، انواع لوازم شخصی برقی، ست هدیه، بهترین انواع عطر و اسپری، انواع زیورآلات طلا و نقره مثل سرویس طلا، سرویس نقره و... به همراه وسایل مراقبت شخصی طبی در گروه زیبایی و سلامت دیجی‌کالا قرار می‌گیرد. در این بخش برندهای مطرحی مثل اسنس، پنبه ریز، سینره و... حضور دارند.

    خانه و آشپزخانه

    یکی از متنوع‌ترین بخش‌های دیجی‌کالا، بخش لوازم خانه و آشپزخانه است که از محصولاتی مثل صندلی گیمینگ در بخش صندلی‌ها گرفته تا انواع مبل راحتی، انواع آبگرمکن مثل آبگرمکن بوتان، لباسشویی‌های متنوع مثل انواع لباسشویی اسنوا، شیرآلات مختلف مثل شیرآلات قهرمان و...، ظروف و همچنین لوازم برقی آشپزخانه مثل توستر و... را شامل می‌شود و امکان خریدی عالی را برای مشتریان فراهم کرده است. در بخش لوازم خانگی دیجی‌کالا، برندهای معتبری مثل تفال، اخوان، فیلیپس، ال جی، اسنوا، جی پلاس و... حضور دارند.

    کتاب، لوازم تحریر و هنر

    بخش هنر، کتاب، رمان و لوازم تحریر دیجی‌کالا نیز یکی از متنوع‌ترین بخش‌های این فروشگاه اینترنتی است. انواع کتاب و مجله، کتاب زبان، بازی، لوازم تحریر با طرح‌های مختلف مانند دختر کفشدوزکی، سازهایی مثل پیانو، سنتور، هنگ درام  و... با بهترین قیمت‌ها و از بهترین برندها در دسترس شما قرار دارند.

    ورزش و سفر

    هر نوع وسیله و لباس ورزشی که فکرش را کنید، انواع وسایل کمپینگ و کوهنوردی، ساک و قمقمه ورزشی و... در این بخش قرار می‌گیرند. همچنین شما می‌توانید وسایل مد نظر خود را بر اساس نوع ورزش (آبی، هوازی، بدنسازی و...) در دسته‌بندی‌های دیجی‌کالا پیدا کنید.

    محصولات بومی و محلی

    و در آخر دیجی‌کالا از طریق به فروش رساندن محصولات بومی و سنتی متفاوتی مثل انواع خوراکی، گلیم و گبه، ابزار و ... تلاش کرده تا بین هنر ایرانی و متقاضیان آن کوتاه‌ترین راه را پیدا کند. در این بخش شما می‌توانید انواع محصولات از جمله ظروف زیبای مخصوص به سفره هفت‌سین  و پذیرایی از مهمانان در روزهای نوروز، انواع آیینه و شمعدان و هر آن چیزی را که برای خلق زیبایی در روزهای بهاری به آن نیاز دارید، با قیمت مناسب و تنوع بسیار بالا انتخاب کنید. همچنین در صفحه برچسب ها، امکان مشاهده و خرید انواع محصولات با طرح های بومی وجود دارد.  دیجی‌کالا همچنین برای اینکه حال و هوای عید را به اعضای خود هدیه کند، تقویم ۱۴۰۱، انواع ایده عکس پروفایل عید نوروز، آهنگ‌های عید نوروز و موزیک‌های شاد بهاری، وسایل مربوط به خانه‌تکانی و انواع لباس های عید  را برای شما فراهم کرده است تا بتوانید در کنار خرید خود، از این حال و هوای تازه نهایت لذت را ببرید.`;

const previewText = text.slice(0, 300);

const Footer = () => {
  const [showMore, setShowMore] = useState(false);
  const toggleShowMore = () => setShowMore(!showMore);
  return (
    <Box
      component="footer"
      dir="rtl"
      sx={{
        bgcolor: 'white',
        color: 'black',
        mt: 15, //dorostesh kon
        // py: 6,
        // px: 4,
      }}
    >
      <Box>
        <Box>
          <Box
            // xs={12}
            // md={10}
            sx={
              {
                // display: 'flex',
                // flexDirection: 'column',
                // justifyContent: 'space-between',
              }
            }
          >
            <Box
              sx={{
                display: 'flex',
                flexDirection: 'column',
                mb: 4,
              }}
            >
              <Box
                sx={{
                  display: 'flex',
                  flexDirection: 'row',
                  alignItems: 'center',
                  justifyContent: 'space-between',
                }}
              >
                <Typography variant="h3" sx={{ color: 'red' }}>
                  دیجی کالا
                </Typography>
                <Button
                  sx={{
                    color: '#3f4064',
                    border: 'solid 1px #3f4064',
                    borderRadius: '10px',
                    mx: '1%',
                    px: '1%',
                  }}
                >
                  بازگشت به بالا
                  <KeyboardArrowUpIcon />
                </Button>
              </Box>
              <Box sx={{ display: 'flex', gap: '1%' }}>
                {abouts.map((about) => (
                  <Typography
                    sx={{ fontSize: '18px', color: '#3f4064', my: '2%' }}
                  >
                    {about}
                  </Typography>
                ))}
              </Box>
              <Box
                sx={{
                  display: 'flex',
                  gap: '3%',
                  justifyContent: 'space-between',
                  alignItems: 'flex-start',
                }}
              >
                <Box>
                  <Typography variant="h5" sx={{ color: 'black' }}>
                    با دیجی کالا
                  </Typography>
                  {baDigiKala.map((bdigi) => (
                    <Typography
                      variant="h6"
                      sx={{ color: '#81858B', my: '3%' }}
                    >
                      {bdigi}
                    </Typography>
                  ))}
                </Box>
                <Box>
                  <Typography variant="h5" sx={{ color: 'black' }}>
                    خدمات مشتریان{' '}
                  </Typography>
                  {customerServices.map((cservicsed) => (
                    <Typography
                      variant="h6"
                      sx={{ color: '#81858B', my: '3%' }}
                    >
                      {cservicsed}
                    </Typography>
                  ))}
                </Box>
                <Box>
                  <Typography variant="h5" sx={{ color: 'black' }}>
                    راهنمای خرید از دیجی کالا
                  </Typography>
                  {BuyingGuideFromDigikala.map((bgfdigikala) => (
                    <Typography
                      variant="h6"
                      sx={{ color: '#81858B', my: '3%' }}
                    >
                      {bgfdigikala}
                    </Typography>
                  ))}
                </Box>
                <Box
                  sx={{ display: 'flex', flexDirection: 'column', mx: '5%' }}
                >
                  <Typography variant="h5" sx={{ color: 'black' }}>
                    همراه ما باشید!
                  </Typography>
                  <Box
                    sx={{
                      display: 'flex',
                      flexDirection: 'row',
                      my: '3%',
                      mx: '-3%',
                    }}
                  >
                    <IconButton
                      href="https://facebook.com"
                      sx={{
                        color: '#81858B',
                      }}
                    >
                      <Facebook sx={{ fontSize: '45px' }} />
                    </IconButton>
                    <IconButton
                      href="https://twitter.com"
                      sx={{
                        color: '#81858B',
                        '&:hover': { color: '#1DA1F2' },
                      }}
                    >
                      <Twitter sx={{ fontSize: '45px' }} />
                    </IconButton>
                    <IconButton
                      href="https://instagram.com"
                      sx={{
                        color: '#81858B',
                        '&:hover': { color: '#E1306C' },
                      }}
                    >
                      <Instagram sx={{ fontSize: '45px' }} />
                    </IconButton>
                    <IconButton
                      href="https://linkedin.com"
                      sx={{
                        color: '#81858B',
                        '&:hover': { color: '#0A66C2' },
                      }}
                    >
                      <LinkedIn sx={{ fontSize: '45px' }} />
                    </IconButton>
                  </Box>
                  <Box>
                    <Typography variant="h5" sx={{ color: 'black' }}>
                      با ثبت ایمیل، از تخفیف ها باخبر شوید
                    </Typography>
                    <Box sx={{ display: 'flex', width: '100%' }}>
                      <TextField
                        label="ایمیل شما"
                        variant="outlined"
                        margin="normal"
                        fullWidth
                        sx={{
                          textAlign: 'right',
                          backgroundColor: '#f0f0f1',
                          height: '55px',
                        }}
                      />
                      <Button
                        sx={{
                          backgroundColor: '#e0e0e2',
                          color: 'white',
                          fontSize: '20px',
                          fontWeight: 900,
                          mx: '3%',
                          my: '5%',
                          height: '55px',
                        }}
                      >
                        ثبت
                      </Button>
                    </Box>
                  </Box>
                </Box>
              </Box>
            </Box>
          </Box>
        </Box>
        <Divider
          sx={{ my: 4, borderColor: 'gray.700', width: '98%', mx: '1%' }}
        />
        <Box
          sx={
            {
              // display: 'flex',
              // justifyContent: 'space-between',
              // alignItems: 'center',
            }
          }
        >
          <Typography variant="h4">
            فروشگاه اینترنتی دیجی‌کالا، بررسی، انتخاب و خرید آنلاین
          </Typography>
          <Box sx={{ padding: '0.5%', my: '1%', width: '50%' }}>
            <Typography variant="body1">
              {showMore ? text : `${previewText}...`}
            </Typography>
            <Button
              onClick={toggleShowMore}
              variant="contained"
              color="primary"
              sx={{
                marginTop: '2%',
                width: '20%',
                color: '#1976d2',
                backgroundColor: 'white',
                boxShadow: 'none',

                ':hover': {
                  backgroundColor: 'white',
                  boxShadow: 'none',
                },
              }}
            >
              {showMore ? 'مشاهده کمتر' : 'مشاهده بیشتر'}
              <KeyboardArrowLeftIcon sx={{ my: '1%', mx: '2%' }} />
            </Button>
          </Box>
        </Box>
      </Box>
    </Box>
  );
};

export default Footer;
